{
  "personal": {
    "name": "Dhanvin Kadiir S",
    "tagline": "Cybersecurity & Networking Enthusiast",
    "bio": "B.Tech CSBS student passionate about cybersecurity, networking, and building secure systems. Experienced in network infrastructure, malware analysis concepts, and modern tools like Docker and n8n.",
    "email": "dhanvinkadiirs@gmail.com",
    "phone": "+91 7397643343",
    "location": "4/475/9 Dhanasekaran Nagar, 2nd Street, Tuticorin - 628002",
    "avatar": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?auto=format&fit=crop&q=80&w=400&h=400"
  },
  "social": [
    {
      "name": "GitHub",
      "url": "https://github.com/DhanvinKadiirS",
      "icon": "github"
    },
    {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/dhanvinkadiirs",
      "icon": "linkedin"
    },
    {
      "name": "Portfolio",
      "url": "https://dhanvin-kadiirs.vercel.app/",
      "icon": "globe"
    }
  ],
  "skills": [
    {
      "name": "Network Infrastructure",
      "level": 90,
      "category": "Cybersecurity & Networking"
    },
    {
      "name": "Malware Analysis Concepts",
      "level": 85,
      "category": "Cybersecurity & Networking"
    },
    {
      "name": "Telecommunications Basics",
      "level": 88,
      "category": "Cybersecurity & Networking"
    },
    {
      "name": "Cybersecurity Fundamentals",
      "level": 92,
      "category": "Cybersecurity & Networking"
    },
    {
      "name": "Docker",
      "level": 80,
      "category": "Tools & Platforms"
    },
    {
      "name": "n8n Automation",
      "level": 85,
      "category": "Tools & Platforms"
    },
    {
      "name": "Linux OS",
      "level": 85,
      "category": "Tools & Platforms"
    },
    {
      "name": "Windows OS",
      "level": 95,
      "category": "Tools & Platforms"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Network Intrusion Detection System (IDS)",
      "description": "Analyzed live network traffic and packet data to identify malicious activities, detect potential intrusions, and understand threat behaviors on a network.",
      "image": "https://images.unsplash.com/photo-1558494949-ef010cbdcc31?auto=format&fit=crop&q=80&w=600",
      "tags": [
        "Packet Analysis",
        "Networking Protocols"
      ],
      "liveUrl": "",
      "githubUrl": "",
      "featured": true
    },
    {
      "id": "2",
      "title": "Optical Fiber Fault Detection",
      "description": "Investigated network failures by detecting downtime locations and connection faults within optical fiber cables to ensure network reliability.",
      "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&q=80&w=600",
      "tags": [
        "Fiber Optics",
        "Networking"
      ],
      "liveUrl": "",
      "githubUrl": "",
      "featured": true
    },
    {
      "id": "3",
      "title": "Malware Reverse Engineering & Cyber Attribution",
      "description": "Currently reverse-engineering malware samples to analyze their core mechanics, map threat behaviors, and understand the origins of cyber attacks.",
      "image": "https://images.unsplash.com/photo-1526374965328-7f61d4dc18c5?auto=format&fit=crop&q=80&w=600",
      "tags": [
        "Malware Analysis",
        "OS Internals",
        "Ongoing"
      ],
      "liveUrl": "",
      "githubUrl": "",
      "featured": true
    }
  ],
  "blogPosts": [
    {
      "id": "1",
      "title": "Securing Web Applications Against Modern Threats",
      "excerpt": "A deep dive into advanced security headers and how to protect applications from XSS, clickjacking, and other common attacks.",
      "content": "## The Evolving Threat Landscape\n\nWeb applications are the primary attack surface for most organizations today. As browsers have become more powerful, so have the attack vectors that malicious actors exploit. In this post, we'll explore the critical HTTP security headers every developer should implement and the reasoning behind each one.\n\n## Essential Security Headers\n\n### Content-Security-Policy (CSP)\n\nCSP is arguably the most powerful security header available. It allows you to define a whitelist of trusted sources for content like scripts, styles, images, and fonts. By restricting where resources can be loaded from, you effectively neutralize most Cross-Site Scripting (XSS) attacks.\n\nA basic CSP might look like: `Content-Security-Policy: default-src 'self'; script-src 'self' https://trusted-cdn.com;`\n\nThe key principle is to start strict and only relax the policy as needed. Avoid using `unsafe-inline` and `unsafe-eval` directives whenever possible, as they significantly weaken your CSP.\n\n### X-Frame-Options & frame-ancestors\n\nClickjacking remains a surprisingly effective attack. An attacker embeds your site within a transparent iframe on a malicious page, tricking users into clicking on your site's buttons and links unknowingly. The `X-Frame-Options` header (or the more modern `frame-ancestors` CSP directive) prevents your pages from being embedded in iframes on untrusted domains.\n\n### Strict-Transport-Security (HSTS)\n\nHSTS forces all connections to your site to use HTTPS, even if a user types `http://` in their browser. This prevents SSL stripping attacks where a man-in-the-middle downgrades the connection to plain HTTP. Once a browser sees this header, it will automatically convert all HTTP requests to HTTPS for the specified duration.\n\n### X-Content-Type-Options\n\nSetting `X-Content-Type-Options: nosniff` prevents browsers from MIME-type sniffing. Without this, a browser might interpret a seemingly harmless file as executable content, opening up avenues for drive-by downloads and other attacks.\n\n## Beyond Headers: Defense in Depth\n\nSecurity headers are just one layer in a defense-in-depth strategy. You should also consider:\n\n- **Input Validation**: Always validate and sanitize user input on the server side. Client-side validation is a UX feature, not a security measure.\n- **Output Encoding**: Encode data before rendering it in HTML to prevent stored XSS.\n- **Rate Limiting**: Protect your authentication endpoints and APIs from brute-force attacks.\n- **Dependency Auditing**: Regularly audit your npm/pip/maven dependencies for known vulnerabilities.\n\n## Key Takeaways\n\nImplementing proper security headers is one of the simplest, highest-impact actions you can take to protect your web applications. Start with CSP, HSTS, and X-Content-Type-Options, and build from there. Security is not a one-time setup but a continuous process of monitoring, updating, and adapting to new threats.",
      "date": "2024-03-01",
      "tags": [
        "Cybersecurity",
        "Web Security",
        "Headers"
      ],
      "featured": true
    },
    {
      "id": "2",
      "title": "The Rise of Generative AI in Cybersecurity",
      "excerpt": "Exploring how Large Language Models (LLMs) are transforming both offensive cyber operations and defensive security automation strategies.",
      "content": "## A Double-Edged Sword\n\nGenerative AI, particularly Large Language Models (LLMs), has fundamentally changed the cybersecurity landscape in 2025–2026. These models are being leveraged by both defenders to automate complex security tasks and by attackers to craft more sophisticated and scalable threats. Understanding this duality is crucial for any cybersecurity professional.\n\n## How Attackers Are Using AI\n\n### Hyper-Realistic Phishing\n\nGone are the days of poorly written phishing emails with obvious grammar mistakes. LLMs can now generate perfectly crafted, contextually relevant phishing messages at scale. They can mimic the writing style of specific individuals by analyzing their public communications, making spear-phishing campaigns far more convincing.\n\n### Automated Vulnerability Discovery\n\nAI-powered tools can analyze source code and binary executables to find vulnerabilities faster than manual code review. While this capability is used by security researchers for good, it also lowers the barrier for attackers to discover zero-day exploits.\n\n### Polymorphic Malware\n\nLLMs can help generate code that constantly changes its signature while maintaining the same malicious functionality. This makes traditional signature-based antivirus detection significantly less effective and pushes defenders toward behavioral analysis.\n\n## How Defenders Are Fighting Back\n\n### AI-Powered SOC Automation\n\nSecurity Operations Centers (SOCs) are overwhelmed with alerts. AI is being used to triage, correlate, and prioritize security events, dramatically reducing the time analysts spend on false positives. An LLM can summarize a complex chain of events into a human-readable incident report in seconds.\n\n### Threat Intelligence Analysis\n\nLLMs excel at ingesting and summarizing vast amounts of threat intelligence reports, CVE databases, and dark web chatter. They can identify emerging threat patterns and provide actionable intelligence to security teams much faster than manual analysis.\n\n### Automated Incident Response\n\nAI-driven playbooks can automatically contain threats by isolating affected systems, blocking malicious IPs, and initiating forensic data collection — all within seconds of detection, long before a human analyst could respond.\n\n## The Road Ahead\n\nThe cybersecurity industry is in an arms race with AI at its center. Organizations that fail to adopt AI-driven defense strategies will fall behind attackers who are already leveraging these tools. Key areas to watch include AI-generated deepfakes for social engineering, autonomous penetration testing, and the evolving regulatory landscape around AI in security.\n\n## Final Thoughts\n\nAs a cybersecurity enthusiast, I believe the key is not to fear AI but to understand and harness it. Defenders who invest in learning about AI capabilities — both offensive and defensive — will be best positioned to protect their organizations in this rapidly evolving landscape.",
      "date": "2026-02-20",
      "tags": [
        "Generative AI",
        "Cybersecurity",
        "LLMs",
        "Automation"
      ],
      "featured": true
    },
    {
      "id": "3",
      "title": "Implementing Zero Trust Architecture",
      "excerpt": "Why perimeter security is no longer enough and how organizations are shifting towards Zero Trust frameworks to mitigate expanding attack surfaces.",
      "content": "## The Death of the Perimeter\n\nTraditional network security operated on a simple principle: build a strong wall around your network, and everything inside is trusted. This castle-and-moat approach made sense when all employees, data, and applications were located within a physical office. But in 2026, with remote work, cloud computing, and SaaS applications being the norm, the perimeter has effectively dissolved.\n\nZero Trust Architecture (ZTA) replaces this outdated model with a fundamental principle: **never trust, always verify**.\n\n## Core Principles of Zero Trust\n\n### 1. Verify Explicitly\n\nEvery access request must be fully authenticated, authorized, and encrypted — regardless of where it originates. A request from inside the corporate network is treated with the same scrutiny as one from a public coffee shop Wi-Fi. This verification uses multiple data points including user identity, device health, location, and the sensitivity of the resource being accessed.\n\n### 2. Least Privilege Access\n\nUsers and applications should only receive the minimum permissions necessary to perform their tasks, and only for the duration needed. This dramatically limits the blast radius if an account is compromised. Instead of granting broad network access, Zero Trust uses micro-segmentation to create fine-grained access policies.\n\n### 3. Assume Breach\n\nZero Trust operates under the assumption that a breach has already occurred or will occur. This mindset drives organizations to implement robust monitoring, logging, and anomaly detection across all systems. If an attacker gains access to one segment, they should find it extremely difficult to move laterally to other parts of the network.\n\n## Key Technologies Enabling Zero Trust\n\n- **Identity and Access Management (IAM)**: Centralized identity providers with multi-factor authentication (MFA) are the foundation of Zero Trust. Strong identity verification is non-negotiable.\n- **Micro-Segmentation**: Dividing the network into small, isolated segments with individual access controls. Each segment has its own security policies, preventing lateral movement.\n- **Software-Defined Perimeter (SDP)**: Creating a dynamic, identity-based perimeter around individual resources rather than entire networks. Resources are invisible to unauthorized users.\n- **Endpoint Detection and Response (EDR)**: Continuous monitoring of endpoints to detect and respond to threats in real-time. Device health is a critical factor in access decisions.\n\n## Practical Implementation Steps\n\n1. **Identify your protect surface**: Map out your most critical data, applications, assets, and services (DAAS).\n2. **Map transaction flows**: Understand how traffic moves across your network to access these critical resources.\n3. **Build your Zero Trust architecture**: Design micro-perimeters around each protect surface.\n4. **Create Zero Trust policies**: Define who can access what, when, and how using the Kipling Method (who, what, when, where, why, how).\n5. **Monitor and maintain**: Continuously log, inspect, and analyze all traffic for anomalies.\n\n## Conclusion\n\nZero Trust is not a product you can buy — it's a strategic framework that requires a cultural shift in how organizations think about security. While the transition can be challenging, the payoff is a significantly more resilient security posture that's better suited to today's distributed, cloud-first world.",
      "date": "2026-01-15",
      "tags": [
        "Architecture",
        "Zero Trust",
        "Network Security"
      ],
      "featured": false
    },
    {
      "id": "4",
      "title": "Quantum Computing: The Cryptography Threat Horizon",
      "excerpt": "Analyzing the impending risks that quantum computers pose to modern public-key cryptography and the push for post-quantum resistant algorithms.",
      "content": "## The Quantum Revolution Is Closer Than You Think\n\nQuantum computing has moved from theoretical physics labs to practical engineering in recent years. Companies like IBM, Google, and startups worldwide are racing to build fault-tolerant quantum computers. While this brings enormous potential for scientific breakthroughs, it poses an existential threat to the cryptographic systems that underpin our entire digital infrastructure.\n\n## Why Current Cryptography Is at Risk\n\nMost of today's public-key cryptography relies on mathematical problems that are extremely difficult for classical computers to solve:\n\n- **RSA** depends on the difficulty of factoring large prime numbers.\n- **Elliptic Curve Cryptography (ECC)** relies on the discrete logarithm problem on elliptic curves.\n- **Diffie-Hellman key exchange** is based on the discrete logarithm problem.\n\nA sufficiently powerful quantum computer running **Shor's algorithm** could break all of these in polynomial time. This means that TLS/SSL, digital signatures, VPNs, encrypted emails, and blockchain technology could all become vulnerable.\n\n## The 'Harvest Now, Decrypt Later' Threat\n\nPerhaps the most alarming aspect is the \"harvest now, decrypt later\" strategy. Nation-state actors are already intercepting and storing encrypted communications today, with the intention of decrypting them once quantum computers become powerful enough. This means that sensitive data encrypted today — government secrets, medical records, financial data — could be exposed in the future.\n\nThis is not a hypothetical scenario; intelligence agencies have publicly acknowledged this risk, and it's driving urgent action in the cryptographic community.\n\n## Post-Quantum Cryptography (PQC)\n\nIn response, NIST (National Institute of Standards and Technology) has been running a multi-year standardization process for post-quantum cryptographic algorithms. In 2024, they finalized their first set of standards:\n\n- **ML-KEM (CRYSTALS-Kyber)**: A lattice-based key encapsulation mechanism for secure key exchange.\n- **ML-DSA (CRYSTALS-Dilithium)**: A lattice-based digital signature algorithm.\n- **SLH-DSA (SPHINCS+)**: A hash-based signature scheme as a backup alternative.\n\nThese algorithms are designed to be resistant to both classical and quantum attacks, and they're already being integrated into major protocols like TLS 1.3.\n\n## What Organizations Should Do Now\n\n1. **Conduct a cryptographic inventory**: Identify all systems, protocols, and data that rely on vulnerable cryptographic algorithms.\n2. **Assess data sensitivity and lifespan**: Data that needs to remain confidential for decades (e.g., healthcare, government) should be prioritized for migration.\n3. **Plan for crypto-agility**: Design systems that can switch between cryptographic algorithms without major refactoring.\n4. **Start testing PQC algorithms**: Integrate NIST-standardized PQC algorithms into development and test environments.\n5. **Monitor quantum computing progress**: Stay informed about breakthroughs that could accelerate the timeline.\n\n## The Timeline\n\nMost experts estimate that a cryptographically relevant quantum computer (CRQC) is 10–15 years away. However, given the long lifecycle of many IT systems and the harvest-now-decrypt-later threat, the time to start preparing is now — not when quantum computers become a reality.\n\n## Conclusion\n\nThe transition to post-quantum cryptography is one of the largest and most critical infrastructure migrations in the history of computing. It will touch every industry, every protocol, and every device that uses encryption. As cybersecurity professionals, we must understand this threat and begin planning the migration today.",
      "date": "2025-11-10",
      "tags": [
        "Quantum Computing",
        "Cryptography",
        "Future Tech"
      ],
      "featured": false
    }
  ],
  "experience": [
    {
      "company": "BSNL - Rajiv Gandhi Memorial Telecom Training Centre",
      "position": "Telecommunication & Data Networking Intern",
      "duration": "June 2025 - June 2025",
      "description": "Completed a 15-day industrial training program. Gained exposure to real-world network operations at a major government facility. Observed practical networking principles, building a foundation for cybersecurity defense."
    }
  ],
  "education": [
    {
      "institution": "Rajalakshmi Engineering College, Chennai",
      "degree": "B.Tech CSBS (Computer Science & Business Systems)",
      "year": "2023 - 2027",
      "description": "GPA: 7.22. Focus on computer science, networking, and business systems."
    },
    {
      "institution": "1st Position - CodeCraft'24 National Level Hackathon",
      "degree": "Award / Achievement",
      "year": "September 2024",
      "description": "Secured 1st position in the Web Development domain during a 2-day national-level hackathon. (Sri Sairam Engineering College)"
    }
  ]
}